{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задача 1.\n",
    "Дана переменная, в которой хранится словарь, \n",
    "содержащий гео-метки для каждого пользователя \n",
    "(пример структуры данных приведен ниже). \n",
    "Вам необходимо написать программу, \n",
    "которая выведет на экран множество уникальных гео-меток всех пользователей.\n",
    "\n",
    "Пример работы программы:\n",
    "\n",
    "ids = {‘user1’: [213, 213, 213, 15, 213],\n",
    "‘user2’: [54, 54, 119, 119, 119],\n",
    "‘user3’: [213, 98, 98, 35]}\n",
    "Результат: {98, 35, 15, 213, 54, 119}\n",
    "\n",
    "***    Использовать множества.\n",
    "Тут очень пригодится использование множеств. \n",
    "Вы можете просто перебирать циклом значения структуры данных и\n",
    "сразу формировать результат через set, все обойдётся одним циклом;\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Результат {98, 35, 213, 54, 119, 15}\n"
     ]
    }
   ],
   "source": [
    "# Задача 1.\n",
    "ids = {'user1': [213, 213, 213, 15, 213],\n",
    "'user2': [54, 54, 119, 119, 119],\n",
    "'user3': [213, 98, 98, 35]}\n",
    "ids_res = {}\n",
    "for element in ids:\n",
    "    ids_res = set(ids[element]).union(ids_res)\n",
    "print('Результат:',(ids_res))\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задача 2.\n",
    "Дана переменная, в которой хранится список поисковых запросов пользователя (пример структуры данных приведен ниже). Вам необходимо написать программу, которая выведет на экран распределение количества слов в запросах в требуемом виде.\n",
    "\n",
    "Пример работы программы:\n",
    "\n",
    "queries = [\n",
    "‘смотреть сериалы онлайн’,\n",
    "‘новости спорта’,\n",
    "‘афиша кино’,\n",
    "‘курс доллара’,\n",
    "‘сериалы этим летом’,\n",
    "‘курс по питону’,\n",
    "‘сериалы про спорт’,\n",
    "]\n",
    "Результат:\n",
    "\n",
    "Поисковых запросов, содержащих 2 слов(а): 42.86%\n",
    "Поисковых запросов, содержащих 3 слов(а): 57.14%\n",
    "***\n",
    "во второй задаче ваша реализация жестко привязана к исходным данным. \n",
    "Ваша задача написать универсальный алгоритм, \n",
    "который будет корректно работать на любых данных аналогичной структуры. \n",
    "А что если запросы будут состоять из любого количества слов от 1 до 1000?\n",
    "Вы же не будете вручную прописывать каждый случай (как сейчас). \n",
    "Я бы рекомендовал использовать в качестве результирующей переменной словарь. \n",
    "Ключами бы в нем были варианты количества слов в запросах, \n",
    "а значениями - количество таких запросов. \n",
    "Формировали бы его так же в цикле, \n",
    "проверяли бы наличие текущей длины в ключах и наращивали бы значение на 1;\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 150,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Поисковых запросов, содержащих 3 слов(а) 4 57.14%\n",
      "Поисковых запросов, содержащих 2 слов(а) 3 42.86%\n",
      "words {'3': 4, '2': 3}\n"
     ]
    }
   ],
   "source": [
    "# Задача 2.\n",
    "queries = [\n",
    "'смотреть сериалы онлайн',\n",
    "'новости спорта',\n",
    "'афиша кино',\n",
    "'курс доллара',\n",
    "'сериалы этим летом',\n",
    "'курс по питону',\n",
    "'сериалы про спорт'\n",
    "]\n",
    "words = {} # объявляю словарь\n",
    "for i in range(len(queries)):\n",
    "    key = str(len(queries[i].split(' ')))# ключ словаря - это количество слов в запросе\n",
    "    words[key] = words.get(key,0) + 1\n",
    "    t = f'В запросе {key} слов(а):'\n",
    "for key, value in words.items():\n",
    "    print(f'Поисковых запросов, содержащих {key} слов(а) {value}','{:.2%}'.format(words[key]/len(queries)))\n",
    "    "
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
